#### InSessionViewSheetSet Members

---

|  |
| --- |
| InSessionViewSheetSet Class   Methods   Properties   See Also |

The  InSessionViewSheetSet  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  InSessionViewSheetSet |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsAutomatic | Automatic order or manual order. |
| Public property | OrderedViewList | Ordered views. |
| Public property | SheetOrganizationId | ElementId  to the  BrowserOrganization  for sheets. |
| Public property | ViewOrganizationId | ElementId  to the  BrowserOrganization  for non-sheet views. |
| Public property | Views | The views. |

# See Also

InSessionViewSheetSet Class

Autodesk.Revit.DB Namespace